{"id":223,"date":"2019-02-08T13:21:14","date_gmt":"2019-02-08T18:21:14","guid":{"rendered":"https:\/\/bsidesorlando.org\/2019\/?p=223"},"modified":"2019-02-08T15:08:55","modified_gmt":"2019-02-08T20:08:55","slug":"changes-to-workshops-this-year","status":"publish","type":"post","link":"https:\/\/bsidesorlando.org\/2019\/changes-to-workshops-this-year\/","title":{"rendered":"Changes to Workshops"},"content":{"rendered":"\n<p>We&#8217;ve made some changes this year to our workshops that we think will help grow BSides Orlando and the talent in the Central Florida community. We have also dedicated ourselves to being transparent about decisions regarding the conference as this is a community event and you are our community.<\/p>\n\n\n\n<p>In previous years all workshops have been 100% free. However, recently we&#8217;ve received feedback that attendees want more technical content, training, and workshops for people who are mid-level in their careers. We also have the opportunity to engage some world class trainers in workshops. To that end we decided to see how we could balanced paid training with our driving ethos of helping grow students and professionals new to security. <\/p>\n\n\n\n<p><strong>We will continue to offer free workshops<\/strong>, but we will also begin to offer some high quality low cost workshops that allow us to bring in professionals from the field to provide training. Our goal is this:<\/p>\n\n\n\n<ol><li><strong>Keep costs for paid workshops low: $50-$100<\/strong> &#8211; This price range is something many students can still afford while also being a price professionals looking for training can manage.<\/li><li><strong>Cover travel for trainers when needed<\/strong> &#8211; Too often conferences ask for favors of professionals to spread knowledge. Our community is amazing, but if we don&#8217;t help them offset some travel costs we are essentially asking them to pay for the privilege of improving our conference. We don&#8217;t want to be that conference.<\/li><li><strong>For some trainers training is their job<\/strong> &#8211; In some cases, we may engage professional trainers that may be compensated for their time. Generally this is in the form of some revenue sharing of the seat count in the class. When we have this type of arrangement it allows the conference to be better and benefits the attendees. The Board will discuss all professional training options and make a decision based on the benefit to the attendees. The goal will always be to deliver the content at low or no cost to attendees.<\/li><li><strong>Any money made after covering costs will go into a speaker travel fund<\/strong> &#8211; We are very excited about this! Essentially, for those that can afford to purchase paid training that money will go into a fund to help cover travel for nationally known technical professionals to come speak at B-Sides Orlando in the future. This will help ensure that students just breaking into the field can hear from some of the best in the business without those pros paying out of pocket to travel to our conference<\/li><\/ol>\n\n\n\n<p>Our goal is always to keep B-Sides Orlando 100% free for students. However, with the feedback we received last year adding some paid workshops strikes a good balance between serving the community, taking care of the people sharing their knowledge through training, and taking any money made and feeding it back into the conference to improve the experience without raising ticket prices<br><br>Let us know what you think and keep an eye out for workshops soon!<br><br>Ean <\/p>\n","protected":false},"excerpt":{"rendered":"<p>We&#8217;ve made some changes this year to our workshops that we think will help grow BSides Orlando and the talent in the Central Florida community. We have also dedicated ourselves to being transparent about decisions regarding the conference as this is a community event and you are our community. In previous years all workshops have &hellip; <\/p>\n","protected":false},"author":2,"featured_media":167,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[7],"tags":[],"_links":{"self":[{"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/posts\/223"}],"collection":[{"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/comments?post=223"}],"version-history":[{"count":3,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/posts\/223\/revisions"}],"predecessor-version":[{"id":227,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/posts\/223\/revisions\/227"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/media\/167"}],"wp:attachment":[{"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/media?parent=223"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/categories?post=223"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/tags?post=223"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}