{"id":176,"date":"2019-01-10T10:18:07","date_gmt":"2019-01-10T15:18:07","guid":{"rendered":"https:\/\/bsidesorlando.org\/2019\/?page_id=176"},"modified":"2019-01-24T10:15:53","modified_gmt":"2019-01-24T15:15:53","slug":"code-of-conduct","status":"publish","type":"page","link":"https:\/\/bsidesorlando.org\/2019\/code-of-conduct\/","title":{"rendered":"Code of Conduct"},"content":{"rendered":"\n<p><strong>Purpose<\/strong><\/p>\n\n\n\n<p>“<em>Respect for right conduct is felt by every body.<\/em>” &#8211; Jane Austen<\/p>\n\n\n\n<p>Security B-Sides Orlando was built to bring together people who have curiosity and passion for information security. We strive to be a gathering where anyone of any gender, race, nationality, religion, or sexual orientation can meet, learn, and grow.<\/p>\n\n\n\n<p>To achieve this goal Security B-Sides Orlando developed our Code of Conduct. The Code of Conduct is meant to create an environment that allows for respectful discourse, constructive debate, open sharing, and positive interactions while facilitating a safe and secure setting for those activities.<\/p>\n\n\n\n<p>All attendees, speakers, staff, media, vendors, sponsors, volunteers, or other participants at Security B-Sides Orlando are asked to follow the below Code of Conduct. Interpretation of the Code of Conduct will be at the sole discretion of the Security B-Sides Orlando staff and board.<\/p>\n\n\n\n<p><strong>Acceptable Conduct<\/strong><\/p>\n\n\n\n<p>“<em>Seek first to understand, then to be understood.<\/em>” &#8211; Stephen Covey<\/p>\n\n\n\n<p>Acceptable behavior during Security B-Sides Orlando includes, but is not limited to:<\/p>\n\n\n\n<ul><li>Showing respect and consideration for anyone you interact with.<\/li><li>Participating in activities that aren’t or can’t be construed as demeaning, insulting, offensive, or harassing.<\/li><li>Assuming positive intent and seeking clarification during discussions where misinterpretation is possible.<\/li><li>Engaging in positive and open discussion.<\/li><li>Being aware of your surroundings and fellow participants: If you see someone violating the Code of Conduct, in an unsafe or threatening situation, violating venue rules, or breaking laws contact a staff member or volunteer immediately. If this is an emergency situation do not hesitate to contact venue security or law enforcement.<\/li><\/ul>\n\n\n\n<p><strong>Unacceptable Conduct<\/strong><\/p>\n\n\n\n<p>“<em>I&#8217;m not shy about heated debate or passionate discourse, but when people get crazy or rude, that&#8217;s a buzz kill. There&#8217;s got to be a better code of conduct, some basic etiquette.<\/em>” &#8211; Mos Def<\/p>\n\n\n\n<p>Unacceptable behavior at Security B-Sides Orlando includes, but is not limited to:<\/p>\n\n\n\n<ul><li>Any intimidation, harassment, abusive, lewd, discriminatory, derogatory, and\/or offensive actions or materials that make anyone at Security B-Sides Orlando feel unwelcome or unsafe.<\/li><li>Assault of any kind including, but not limited to, verbal attacks and<br>inappropriate physical contact.<\/li><li>Assumption of consent for any actions where consent must be explicit.<\/li><li>Violations of venue rules. (Smoking, Vaping, Open Containers in areas not approved for these activities)<\/li><li>Any illegal activity including actions or materials that violate Local, State, or Federal law.<\/li><\/ul>\n\n\n\n<p>At any point if you are asked to stop unacceptable behavior you are expected to comply immediately.<\/p>\n\n\n\n<p><strong>Results of Unacceptable Conduct<\/strong><\/p>\n\n\n\n<p>“<em>You don&#8217;t have to go home, but you can&#8217;t stay here.<\/em>” – The Oakridge Boys<\/p>\n\n\n\n<p>Unacceptable behavior will not be tolerated.<\/p>\n\n\n\n<p>The Security B-Sides Orlando staff and board as well as the host venue reserve the right to remove anyone from the conference who is found to be in violation of the Code of Conduct at any time without warning, refund, or recourse.<\/p>\n\n\n\n<p>In some cases this may include reporting the individual or group to venue security or law enforcement.<\/p>\n\n\n\n<p>This Code of Conduct is meant to avoid situations where this is necessary. However, it is important to inform anyone taking part in Security B-Sides Orlando that the safety and dignity of all who attend is our highest priority.<\/p>\n\n\n\n<p><strong>What to do if you Witness Unacceptable Behavior<\/strong><\/p>\n\n\n\n<p>Report any violations of the Code of Conduct to a Security B-Sides Orlando staff member immediately. Staff members are available to escort you to an area where you feel safe. Staff members will address the unacceptable behavior. Any staff member can also help you coordinate with emergency medical services, site security, or law enforcement.<\/p>\n\n\n\n<p>In an emergency situation do not hesitate to contact emergency services or law enforcement directly.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Purpose “Respect for right conduct is felt by every body.” &#8211; Jane Austen Security B-Sides Orlando was built to bring together people who have curiosity and passion for information security. We strive to be a gathering where anyone of any gender, race, nationality, religion, or sexual orientation can meet, learn, and grow. To achieve this &hellip; <\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/pages\/176"}],"collection":[{"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/comments?post=176"}],"version-history":[{"count":1,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/pages\/176\/revisions"}],"predecessor-version":[{"id":178,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/pages\/176\/revisions\/178"}],"wp:attachment":[{"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/media?parent=176"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}