{"id":45,"date":"2018-12-05T20:47:18","date_gmt":"2018-12-06T01:47:18","guid":{"rendered":"https:\/\/bsidesorlando.org\/2019\/?page_id=45"},"modified":"2019-01-07T11:38:44","modified_gmt":"2019-01-07T16:38:44","slug":"sponsorship","status":"publish","type":"page","link":"https:\/\/bsidesorlando.org\/2019\/sponsorship\/","title":{"rendered":"Application"},"content":{"rendered":"<p>Download our Sponsorship Packet to get more information about how you can sponsor Security B-Sides Orlando 2019. The event comes down to sponsor and supporters to help fund the show. Without them, none of this would be possible.<\/p>\n<p><u><a href=\"https:\/\/bsidesorlando.org\/2019\/wp-content\/uploads\/Sponsorship_Guide_2019.pdf\" target=\"_blank\" rel=\"noopener\">Sponsorship Guide<\/a><\/u><\/p>\n<p>The goal of Security B-Sides Orlando is to offer small intimate events where all participants can engage each other to help develop connections and friendships, and network with different industry professionals.<\/p>\n<p>We recognize the value in engaging a smaller audience and every organization will have different goals and priorities. This is why we offer different levels of participation for every individual, group, or organization. We specifically designed several different options for any sized organization to participate and support this event.<\/p>\n<p>Security B-Sides Orlando attendees are hungry and very often looking to be part of the next big thing. From this pool of attendees a large portion are either looking for a new job, or looking to get their start in the industry. The biggest value of Security B-Sides Orlando is recruitment from a large list of potential candidates.<\/p>\n<p>We recognize your desire to not only support a great event but also to see a return on your investment. The following is a list of direct benefits you may see as an event sponsor:<\/p>\n<ul>\n<li><strong>Brand Recognition and Awareness<\/strong><br \/>\nDepending on the level of sponsorship, you may recognize your brand placement on some or all of the following: – shirts, signage\/lanyards, lunch sessions, attendee badges, and the website. Based on your level of participation, creative and custom branding may be arranged including transportation, banners, and podcast interviews.<\/li>\n<li><strong>Big Fish, Small Pond<\/strong><br \/>\nFor some, sponsoring large events is not within their price range, leaving them with no option for communicating their message. Bsides Orlando is just the place for you! This small, community atmosphere brings together active and engaged participants who want to absorb information. Sponsoring Bsides Orlando enables you to better communicate your message to an active audience.<\/li>\n<li><strong>Keep In Touch With The Industry<\/strong><br \/>\nBsides Orlando enables its supporters and participants to identify and connect with industry leaders and voices. These participants represent the social networking of security. They are the people who you want to engage to solicit feedback and bring voice to your conversation.<\/li>\n<li><strong>Stay Abreast On the Next Big Thing<\/strong><br \/>\nNobody knows what the “next big thing” will be, but these events are community-driven with presentations voted upon by the industry. There is no magic to how it works, but we believe that listening to the underground can help you prepare and identify what the next big thing might be.<\/li>\n<li><strong>Video Recording<\/strong><br \/>\nBsides Orlando’s talks are recorded, meaning that your participation can reach a larger audience than those participants at the event. Last year’s videos reached double the attendees at each talk.<\/li>\n<li><strong>Visibility<\/strong><br \/>\nBsides Orlando’s website received over 40,000 page views in the months leading up to the conference. The sponsorship page is a great virtual poster board to show your support with direct links back to your business.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Download our Sponsorship Packet to get more information about how you can sponsor Security B-Sides Orlando 2019. The event comes down to sponsor and supporters to help fund the show. Without them, none of this would be possible. Sponsorship Guide The goal of Security B-Sides Orlando is to offer small intimate events where all participants &hellip; <\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/pages\/45"}],"collection":[{"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/comments?post=45"}],"version-history":[{"count":5,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/pages\/45\/revisions"}],"predecessor-version":[{"id":130,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/pages\/45\/revisions\/130"}],"wp:attachment":[{"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/media?parent=45"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}