{"id":481,"date":"2019-03-19T11:26:36","date_gmt":"2019-03-19T16:26:36","guid":{"rendered":"https:\/\/bsidesorlando.org\/2019\/?page_id=481"},"modified":"2019-03-19T11:27:05","modified_gmt":"2019-03-19T16:27:05","slug":"workshops","status":"publish","type":"page","link":"https:\/\/bsidesorlando.org\/2019\/workshops\/","title":{"rendered":"Workshops"},"content":{"rendered":"\n<p>Capture the Flag (CTF) 101<br>Alex Lynch<br>Ever wanted to prove how badass of a hacker you are without the risk of federal incarceration? Or maybe you just want to hone your skills with realistic challenges often put together by industry professionals? Then you should compete in a CTF! CTF competitions are the ultimate test of technical know-how across a broad range of categories such as web exploitation, binary reverse engineering and exploitation, cryptography, and more.<\/p>\n\n\n\n<p>Burp Suite Like a Pro<br>Sunny Wear<br>Gain hands-on experience with Burp Suite in this three hour workshop with the author of the Burp Suite Cookbook. She will teach you how to start using Burp Suite like a pro! Burp Suite calibration, intruding with Intruder, extending functionality with extensions, and writing macros will all be covered.<\/p>\n\n\n\n<p>A Modern and Practical Introduction to Software Reverse Engineering<br>Hahna Kane Latonick<br>This course introduces students to software reverse engineering using a modern and practical approach. Students will walk away from this class knowing how to reverse x64 and x86 binaries. We believe it’s best to learn by doing; therefore, the concepts covered in this training will be taught primarily through hands-on exercises using modern tools for static analysis.<\/p>\n\n\n\n<p>OSINT Workshop<br>Joe Gray<br>This four-hour workshop starts with an introduction to Open Source Intelligence (OSINT) and progresses into gathering information from social media and other sources that businesses use. The course will also touch on use case scenarios that include threat intelligence, reconnaissance, and social engineering. We will discuss “People OSINT” and “Business OSINT.” The only thing required for this course is an open mind, a computer (no specific operating system, although Kali or Buscador are ideal.), and an internet connection. Should you choose to use a vanilla Linux host, acquire the tools and API keys listed in this GitHub Repo: https:\/\/github.com\/jocephus\/ESEP<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Capture the Flag (CTF) 101Alex LynchEver wanted to prove how badass of a hacker you are without the risk of federal incarceration? Or maybe you just want to hone your skills with realistic challenges often put together by industry professionals? Then you should compete in a CTF! CTF competitions are the ultimate test of technical &hellip; <\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/pages\/481"}],"collection":[{"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/comments?post=481"}],"version-history":[{"count":1,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/pages\/481\/revisions"}],"predecessor-version":[{"id":482,"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/pages\/481\/revisions\/482"}],"wp:attachment":[{"href":"https:\/\/bsidesorlando.org\/2019\/wp-json\/wp\/v2\/media?parent=481"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}